# Задача 31: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону
#
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]


array = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min, max = int(input('Введите диапазон поиска(min, max): ')), \
    int(input())

print(list(map(lambda x: x[0], [i for i in enumerate(array) if min <= i[1] <= max])))
